/* 
What is OOP ?
Ans : object-oriented হচ্ছে একটা প্রোগ্রামিং প্যারাডাইম, আমরা যে স্টাইলে code করব সেই স্টাইলটা কে  বলে object-oriented.

WHat is class ?
Ans : Class একটা ফ্যাক্টরি ফাংশন যেটা দ্বারা অনেক অনেক অবজেক্ট তৈরি করা যাবে কিন্তু কোন code ডুবলিকেট করা হবে না. যেমন বাফা পিঠা তৈরি করি একটা ফ্রেম দিয়ে , আর একটা ফ্রেম দিয়ে অনেক অনেক বাফা পিঠা তৈরি করা যায়।

Object Orented মূলত একটা থিওরি আর এই থিওরি টা আপনি যেকোন ল্যাংগুয়েজের ক্ষেত্রেই এপ্লাই করতে পারবেন.
OOP স্ট্যান্ড অন মেইন 4 পিলার
    Abstraction -  Class/Object ফাংশনালিটি হাইড করা, ইউজারের জানা দরকার নেই এমন সকল ফাংশনালিটি হাইড করা 
    Encapsulation - একটা Object এর ভিতর Property আর Methods তাকে দুইটাকে যে একটা জায়গায় বাইন্ডিং করা হচ্ছে তাকে Encapsulation বলে 
    Inheritance - অন্যের বৈশিষ্ট্য নিজের ভিতর ধারণ করা
    Polymorphism - বহুরূপী, একটা Object বিভিন্ন রূপে নিজেকে রিপ্রেজেন্ট করতে পারে


*/

